{"meta":{"title":"Yunyi's Website","subtitle":null,"description":null,"author":"Yunyi","url":"http://yunyishen.ml"},"pages":[{"title":"About me","date":"2018-08-01T13:00:14.705Z","updated":"2018-08-01T13:00:14.705Z","comments":true,"path":"about/index.html","permalink":"http://yunyishen.ml/about/index.html","excerpt":"","text":"I am a wildlife ecology student who is trying to make a website. I am from Xi’an, China and completed a bachelor’s degree in Integrated Sciences (a physics-biology interdisciplinary undergraduate program) from Peking University in 2018. Just like my name in Chinese -云逸- which means ‘free as cloud’, I love traveling, especially in the wild. I came to wildlife ecology after a field trip studying white headed langur in Guangxi and after then I worked as a lab member in Qinling Mts and Minshan Mts both for wild panda projects. My research in this period focuses on modelling of species distribution and diversity patterns as well as their explanation, however, I always believe, ecological process can be better understood if one could understand its mechanism at or even below population level. So in UW-Madison, I will try to develop statistical tools for wildlife population estimation, dynamics and conservation genetics under the advisement of Tim Van Deelen, and cooperate with my PKU research mentor, Sheng Li, to answer the questions about wildlife ecology and management both in the US and China. My CV 20180721"},{"title":"Categories","date":"2018-07-26T05:29:53.488Z","updated":"2018-07-26T05:29:53.488Z","comments":true,"path":"categories/index.html","permalink":"http://yunyishen.ml/categories/index.html","excerpt":"","text":""},{"title":"Tags","date":"2018-07-26T05:29:53.490Z","updated":"2018-07-26T05:29:53.490Z","comments":true,"path":"tags/index.html","permalink":"http://yunyishen.ml/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"This Week's Finds: Muntjacs in QJY National Park","slug":"This-Week-s-Finds-Muntjacs-in-QJY-National-Park","date":"2018-08-06T02:18:20.000Z","updated":"2018-08-13T23:51:10.623Z","comments":true,"path":"2018/08/05/This-Week-s-Finds-Muntjacs-in-QJY-National-Park/","link":"","permalink":"http://yunyishen.ml/2018/08/05/This-Week-s-Finds-Muntjacs-in-QJY-National-Park/","excerpt":"","text":"After a long travel from Beijing China to Madison WI, I finally arrived and overcame the jetlag of 13 hours. This week’s find is part of my new project doing for Qianjiangyuan National Park and highly related to my MS project, coexistence of two ungulates in South-East China. I used camera trapping occurrence data and environmental layers with Ecological Niche Model(ENM, actually, MaxEnt), to evaluate whether core region of the National Park could cover the distribution area of its target species, Black Muntjac (Muntiacus crinifrons). Model has good performance according to 5-fold cross validation and ROC-AUC test(0.859, se=0.03). For the primary question, whether it can be well conserved by the legislation about core area of Nation Parks, the short answer according to my result is: yes. 64.4% of the predicted distribution area was in core area while 34.8% of it was in restoration area, means tourism (which is great important for National Parks and stackholders) won’t occur in the distribution area of black muntjac. But what is the most important environmental factors for this prediction? The next table is all the environmental layers I used to predict the distribution:Jackknife test may give us insight about the most important factor(s). Jackknife results showed that, Total Road Density is the most informative single factor, which can get 48.3%(se=1.3%) of the total gain, Forest Origin is the most necessary factor for model performance, without it model gain will reduce to 76.1%(se=0.42%) of the total gain, meanwhile, Forest Origin is also a good single factor, which can get 44.5%(se=1.2%) of the total gain, means forest origin is important for the model in both way. Reaction curve showed black muntjacs avoid high road density and like old growth forest. But the problem is, as we could see, distribution is patchy, and the model was a niche based model, however, in pachy landscape, niche differenciation may be not only way for species to coexist, for example, Leibold et al. 2004‘s 4 paradigms for two species coexist in pachy landscape: (a) patch-dynamics, (b) species-sorting, (c) mass-effects and (d) neutral. In (a) the patch dynamics paradigm is shown with conditions that permit coexistence: a competition-colonization trade-off is illustrated with species A being a superior competitor but species B being a superior colonist; the third patch is vacant and could become occupied by either species. In (b) species are separated into spatial niches and dispersal is not sufficient to alter their distribution. In (c) mass effects cause species to be present in both source and sink habitats; the smaller letters and symbols indicate smaller sized populations. In (d) all species are currently present in all patches; species would gradually be lost from the region and would be replaced by speciation. (Leibold et al. 2004) How to test different hypothsis of coexistence in pathy landscape remains a chanllenge for my MS’s project.","categories":[],"tags":[{"name":"This Week's Finds","slug":"This-Week-s-Finds","permalink":"http://yunyishen.ml/tags/This-Week-s-Finds/"}]},{"title":"This Week’s Finds: Start and The Website Itself","slug":"Start-of-This-Week-s-Finds","date":"2018-07-29T03:36:49.000Z","updated":"2018-08-16T21:06:15.625Z","comments":true,"path":"2018/07/28/Start-of-This-Week-s-Finds/","link":"","permalink":"http://yunyishen.ml/2018/07/28/Start-of-This-Week-s-Finds/","excerpt":"","text":"John Baez, a mathematical physicist form UCR, writes down approximately every week what he found (from papers, books, researches, etc.) in that week since 1993. The posts could be found here. The name (as well as the content) of this column, changed from This Week’s Finds in Mathematical Physics to This Week’s Finds in 2010. I love this idea and will try hard to follow him though I do not think I could really do every week. The First This Week’s Finds is about this blog itself. It is based on Github Pages and Hexo. The Domain yunyishen.ml is ‘bought’ from dot.tk with $0 price. Github Pages is a special Github repository which is the host of the website for you and your project. It is easy to start by creating a new repository named username.github.io. I also tried to fork other’s Github Pages repository and rename it, which works well. Also by adding a file called CNAME containing your own domain name to the master brunch of this repository, and setting your domain’s DNS to Github, your Github Pages could be visit through your own domain name. The next step, generally speaking, is to put appropriate stuff into the new repository. I believe not all ecology guys know PHP, at least I do not know, thus we need tools to help us generate htmls. Hexo offers an easy way. It uses Markdown language(Wikipedia) to convert plain text (like txt) to html files. I have to say it is also hard but at least much easier than PHP. Users of Hexo also open sourced thousands of themes for others to use (e.g. my page is using icarus) so you do not need to code the structure of you website, insteat, the only thing needed is to edit _config.yml files. Posting is also easy, what you need to do consist of 3 steps, creating new post, editing, and push files into your repository. The first and last step can be done with two one-line command in Git bash. The only thing complex is to write. Though actually there are a lot of tricks in using Markdown and Github I do not know, I am still happy that I made myself a website last week.","categories":[],"tags":[{"name":"This Week's Finds","slug":"This-Week-s-Finds","permalink":"http://yunyishen.ml/tags/This-Week-s-Finds/"}]},{"title":"A Small Step","slug":"A-Small-Step","date":"2018-07-26T12:21:42.000Z","updated":"2018-07-26T12:23:15.618Z","comments":true,"path":"2018/07/26/A-Small-Step/","link":"","permalink":"http://yunyishen.ml/2018/07/26/A-Small-Step/","excerpt":"","text":"That’s one small step for (a) website, one giant leap for Yunyi.","categories":[],"tags":[{"name":"Web tech","slug":"Web-tech","permalink":"http://yunyishen.ml/tags/Web-tech/"}]},{"title":"Hello World","slug":"hello-world","date":"2018-07-26T05:48:16.270Z","updated":"2018-07-26T04:38:51.145Z","comments":true,"path":"2018/07/26/hello-world/","link":"","permalink":"http://yunyishen.ml/2018/07/26/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}