{"meta":{"title":"Yunyi's Website","subtitle":null,"description":null,"author":"Yunyi","url":"http://yunyishen.ml"},"pages":[{"title":"About me","date":"2018-07-31T14:29:04.713Z","updated":"2018-07-31T14:29:04.713Z","comments":true,"path":"about/index.html","permalink":"http://yunyishen.ml/about/index.html","excerpt":"","text":"I am a wildlife ecology student who is trying to make a website. I am from Xi’an, China and completed a bachelor’s degree in Integrated Sciences (a physics-biology interdisciplinary undergraduate program) from Peking University in 2018. Just like my name in Chinese 云逸 which means ‘free as cloud’, I love traveling, especially in the wild. I came to wildlife ecology after a field trip studying white headed langur in Guangxi and after then I workeded as lab member to Qinling Mts and Minshan Mts both for wild panda projects. My research in this period focuses on modelling of species distribution and diversity patterns as well as their explanation, however I always believe, ecological process can be better understood if one could understand its mechanism at or even below population level. So in UW-Madison, I will try to develop statistical tools for wildlife population estimation, dynamics and conservation genetics under the advisement of Tim Van Deelen, and cooperate with my PKU research mentor, Sheng Li, to answer the questions about wildlife ecology and management both in US and China. My CV 20180721"},{"title":"Categories","date":"2018-07-26T05:29:53.488Z","updated":"2018-07-26T05:29:53.488Z","comments":true,"path":"categories/index.html","permalink":"http://yunyishen.ml/categories/index.html","excerpt":"","text":""},{"title":"Tags","date":"2018-07-26T05:29:53.490Z","updated":"2018-07-26T05:29:53.490Z","comments":true,"path":"tags/index.html","permalink":"http://yunyishen.ml/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"This Week’s Finds: Start and The Website Itself","slug":"Start-of-This-Week-s-Finds","date":"2018-07-28T14:36:49.000Z","updated":"2018-07-28T16:04:16.226Z","comments":true,"path":"2018/07/28/Start-of-This-Week-s-Finds/","link":"","permalink":"http://yunyishen.ml/2018/07/28/Start-of-This-Week-s-Finds/","excerpt":"","text":"John Baez, a mathematical physicist form UCR, writes down approximately every week what he found (from papers, books, researches, etc.) in that week since 1993. The posts could be found here. The name (as well as the content) of this column, changed from This Week’s Finds in Mathematical Physics to This Week’s Finds in 2010. I love this idea and will try hard to follow him though I do not think I could really do every week. The First This Week’s Finds is about this blog itself. It is based on Github Pages and Hexo. The Domain yunyishen.ml is ‘bought’ from dot.tk with $0 price. Github Pages is a special Github repository which is the host of the website for you and your project. It is easy to start by creating a new repository named username.github.io. I also tried to fork other’s Github Pages repository and rename it, which works well. Also by adding a file called CNAME containing your own domain name to the master brunch of this repository, and setting your domain’s DNS to Github, your Github Pages could be visit through your own domain name. The next step, generally speaking, is to put appropriate stuff into the new repository. I believe not all ecology guys know PHP, at least I do not know, thus we need tools to help us generate htmls. Hexo offers an easy way. It uses Markdown language(Wikipedia) to convert plain text (like txt) to html files. I have to say it is also hard but at least much easier than PHP. Users of Hexo also open sourced thousands of themes for others to use (e.g. my page is using icarus) so you do not need to code the structure of you website, insteat, the only thing needed is to edit _config.yml files. Posting is also easy, what you need to do consist of 3 steps, creating new post, editing, and push files into your repository. The first and last step can be done with two one-line command in Git bash. The only thing complex is to write. Though actually there are a lot of tricks in using Markdown and Github I do not know, I am still happy that I made myself a website last week.","categories":[],"tags":[{"name":"This Week’s Finds","slug":"This-Week’s-Finds","permalink":"http://yunyishen.ml/tags/This-Week’s-Finds/"}]},{"title":"A Small Step","slug":"A-Small-Step","date":"2018-07-26T12:21:42.000Z","updated":"2018-07-26T12:23:15.618Z","comments":true,"path":"2018/07/26/A-Small-Step/","link":"","permalink":"http://yunyishen.ml/2018/07/26/A-Small-Step/","excerpt":"","text":"That’s one small step for (a) website, one giant leap for Yunyi.","categories":[],"tags":[{"name":"Web tech","slug":"Web-tech","permalink":"http://yunyishen.ml/tags/Web-tech/"}]},{"title":"Hello World","slug":"hello-world","date":"2018-07-26T05:48:16.270Z","updated":"2018-07-26T04:38:51.145Z","comments":true,"path":"2018/07/26/hello-world/","link":"","permalink":"http://yunyishen.ml/2018/07/26/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}